Plan:
`
  # module.appeal_tax_tribunal_service_gov_uk_records.aws_route53_record.this["_acme-challenge.appeal-tax-tribunal.service.gov.uk._TXT"] will be updated in-place
  ~ resource "aws_route53_record" "this" {
        id      = "Z1P5X6HIHP91XH__acme-challenge.appeal-tax-tribunal.service.gov.uk._TXT"
        name    = "_acme-challenge.appeal-tax-tribunal.service.gov.uk"
      ~ records = [
          + "UPTlANXnn5-EVudKy2VqaX22S6NQk0mrKMPN6jKGuVc",
          - "gKRej2crvHAATtd_CsnGtsC0loWhIBJg3z3USUV_7MA",
          + "sQGUQOxKnGYs9eKxHF0g9_Yn8g33cEIlbpmxmCJgY68",
          - "yP1b2fyuHqZ_RcXDYV8nbH1FhYQuCt5KHusTAONwgg0",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.devl_justice_gov_uk_records.aws_route53_record.this["_mta-sts.devl.justice.gov.uk._TXT"] will be updated in-place
  ~ resource "aws_route53_record" "this" {
        id      = "ZGHDSGKG9UCRD__mta-sts.devl.justice.gov.uk._TXT"
        name    = "_mta-sts.devl.justice.gov.uk"
      ~ records = [
          - "v=STSv1; id=4adfca9f114c6d7c82119b69fa97fece",
          + "v=STSv1; id=9dff2abf74d878fca409eae56208db91",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.dsd_io_records.aws_route53_record.this["can-you-get-legal-aid.dsd.io._A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "can-you-get-legal-aid.dsd.io"
      + type            = "A"
      + zone_id         = "Z31RX3GZS94JZS"

      + alias {
          + evaluate_target_health = false
          + name                   = "s3-website-eu-west-1.amazonaws.com"
          + zone_id                = "Z1BKCTXD74EZPE"
        }
    }

  # module.dsd_io_records.aws_route53_record.this["can-you-get-legal-aid.dsd.io._CNAME"] will be destroyed
  # (because key ["can-you-get-legal-aid.dsd.io._CNAME"] is not in for_each map)
  - resource "aws_route53_record" "this" {
      - fqdn    = "can-you-get-legal-aid.dsd.io" -> null
      - id      = "Z31RX3GZS94JZS_can-you-get-legal-aid.dsd.io._CNAME" -> null
      - name    = "can-you-get-legal-aid.dsd.io" -> null
      - records = [
          - "can-you-get-legal-aid.dsd.io.s3-website-eu-west-1.amazonaws.com",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z31RX3GZS94JZS" -> null
    }

  # module.dsd_io_records.aws_route53_record.this["ctf.dsd.io._A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ctf.dsd.io"
      + type            = "A"
      + zone_id         = "Z31RX3GZS94JZS"

      + alias {
          + evaluate_target_health = false
          + name                   = "s3-website-eu-west-1.amazonaws.com"
          + zone_id                = "Z1BKCTXD74EZPE"
        }
    }

  # module.dsd_io_records.aws_route53_record.this["ctf.dsd.io._CNAME"] will be destroyed
  # (because key ["ctf.dsd.io._CNAME"] is not in for_each map)
  - resource "aws_route53_record" "this" {
      - fqdn    = "ctf.dsd.io" -> null
      - id      = "Z31RX3GZS94JZS_ctf.dsd.io._CNAME" -> null
      - name    = "ctf.dsd.io" -> null
      - records = [
          - "ctf.dsd.io.s3-website-eu-west-1.amazonaws.com",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z31RX3GZS94JZS" -> null
    }

  # module.dsd_io_records.aws_route53_record.this["et.dashboard.dsd.io._A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "et.dashboard.dsd.io"
      + type            = "A"
      + zone_id         = "Z31RX3GZS94JZS"

      + alias {
          + evaluate_target_health = false
          + name                   = "s3-website-eu-west-1.amazonaws.com"
          + zone_id                = "Z1BKCTXD74EZPE"
        }
    }

  # module.dsd_io_records.aws_route53_record.this["et.dashboard.dsd.io._CNAME"] will be destroyed
  # (because key ["et.dashboard.dsd.io._CNAME"] is not in for_each map)
  - resource "aws_route53_record" "this" {
      - fqdn    = "et.dashboard.dsd.io" -> null
      - id      = "Z31RX3GZS94JZS_et.dashboard.dsd.io._CNAME" -> null
      - name    = "et.dashboard.dsd.io" -> null
      - records = [
          - "et.dashboard.dsd.io.s3-website-eu-west-1.amazonaws.com",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z31RX3GZS94JZS" -> null
    }

  # module.dsd_io_records.aws_route53_record.this["one3one.dsd.io._CNAME"] will be destroyed
  # (because key ["one3one.dsd.io._CNAME"] is not in for_each map)
  - resource "aws_route53_record" "this" {
      - fqdn    = "one3one.dsd.io" -> null
      - id      = "Z31RX3GZS94JZS_one3one.dsd.io._CNAME" -> null
      - name    = "one3one.dsd.io" -> null
      - records = [
          - "one3one.dsd.io.s3-website-eu-west-1.amazonaws.com.",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z31RX3GZS94JZS" -> null
    }

  # module.dsd_io_records.aws_route53_record.this["static.dsd.io._A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "static.dsd.io"
      + type            = "A"
      + zone_id         = "Z31RX3GZS94JZS"

      + alias {
          + evaluate_target_health = false
          + name                   = "s3-website-eu-west-1.amazonaws.com"
          + zone_id                = "Z1BKCTXD74EZPE"
        }
    }

  # module.dsd_io_records.aws_route53_record.this["static.dsd.io._CNAME"] will be destroyed
  # (because key ["static.dsd.io._CNAME"] is not in for_each map)
  - resource "aws_route53_record" "this" {
      - fqdn    = "static.dsd.io" -> null
      - id      = "Z31RX3GZS94JZS_static.dsd.io._CNAME" -> null
      - name    = "static.dsd.io" -> null
      - records = [
          - "static.dsd.io.s3-website-eu-west-1.amazonaws.com",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z31RX3GZS94JZS" -> null
    }
  # module.financeandtaxtribunals_gov_uk_records.aws_route53_record.this["_acme-challenge.financeandtaxtribunals.gov.uk._TXT"] will be updated in-place
  ~ resource "aws_route53_record" "this" {
        id      = "Z3HV9QD5K7DR1B__acme-challenge.financeandtaxtribunals.gov.uk._TXT"
        name    = "_acme-challenge.financeandtaxtribunals.gov.uk"
      ~ records = [
          - "8Q_DwBrX8FGQgK-Ww52crBvWsZxDreNKRmfxs2QyVpw",
          + "uq5s_fJvCpbz3XExy6P61dNOsYuybCx8mjJWaHgGRKM",
        ]
        # (4 unchanged attributes hidden)
    }
  # module.publicguardian_gov_uk_records.aws_route53_record.this["_dmarc.publicguardian.gov.uk_TXT"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc.publicguardian.gov.uk"
      + records         = [
          + "_dmarc_ttp_policy.justice.gov.uk",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z01126121SKXV1BMJWB6J"
    }
  # module.publicguardian_gov_uk_records.aws_route53_record.this["publicguardian.gov.uk_TXT"] will be updated in-place
  ~ resource "aws_route53_record" "this" {
        id      = "Z01126121SKXV1BMJWB6J_publicguardian.gov.uk_TXT"
        name    = "publicguardian.gov.uk"
      ~ records = [
          - "MS=ms49968440",
          + "MS=ms49968440\\\",\\\"v=spf1 ip4:194.33.196.8/32 ip4:194.33.192.8/32  include:spf.protection.outlook.com -all",
          - "v=spf1 ip4:194.33.196.8/32 ip4:194.33.192.8/32 include:spf.protection.outlook.com -all",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.yjb_gov_uk_zone.aws_route53_zone.this will be updated in-place
  ~ resource "aws_route53_zone" "this" {
      + force_destroy = false
        id            = "Z2XUK6JT4R59WG"
        name          = "yjb.gov.uk"
      ~ tags          = {
          + "application"   = "Youth Justice Board root domain"
          + "business-unit" = "YJB"
          - "component"     = "None" -> null
          + "is-production" = "true"
          + "owner"         = "Youth Justice Board ICT: ict@yjb.gov.uk"
          + "source-code"   = "github.com/ministryofjustice/dns-iac"
          + "terraform"     = "true"
        }
      ~ tags_all      = {
          + "application"   = "Youth Justice Board root domain"
          + "business-unit" = "YJB"
          - "component"     = "None" -> null
          + "is-production" = "true"
          + "owner"         = "Youth Justice Board ICT: ict@yjb.gov.uk"
          + "source-code"   = "github.com/ministryofjustice/dns-iac"
          + "terraform"     = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.yjbpublications_justice_gov_uk_zone.aws_route53_zone.this will be updated in-place
  ~ resource "aws_route53_zone" "this" {
      + force_destroy = false
        id            = "ZOWETSDOUBIY6"
        name          = "yjbpublications.justice.gov.uk"
      ~ tags          = {
          + "application"   = "Youth Justice Board Publications: Redirect to GOV.UK"
          + "business-unit" = "YJB"
          - "component"     = "None" -> null
          + "is-production" = "true"
          + "owner"         = "Youth Justice Board ICT: ict@yjb.gov.uk"
          + "source-code"   = "github.com/ministryofjustice/dns-iac"
          + "terraform"     = "true"
        }
      ~ tags_all      = {
          + "application"   = "Youth Justice Board Publications: Redirect to GOV.UK"
          + "business-unit" = "YJB"
          - "component"     = "None" -> null
          + "is-production" = "true"
          + "owner"         = "Youth Justice Board ICT: ict@yjb.gov.uk"
          + "source-code"   = "github.com/ministryofjustice/dns-iac"
          + "terraform"     = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.yjils_justice_gov_uk_zone.aws_route53_zone.this will be updated in-place
  ~ resource "aws_route53_zone" "this" {
      + force_destroy = false
        id            = "Z3QFKRHTT354MT"
        name          = "yjils.justice.gov.uk"
      ~ tags          = {
          + "application"   = "Youth Justice Interactive Learning Space"
          + "business-unit" = "YJB"
          - "component"     = "None" -> null
          + "is-production" = "true"
          + "owner"         = "Youth Justice Board ICT: ict@yjb.gov.uk"
          + "source-code"   = "github.com/ministryofjustice/dns-iac"
          + "terraform"     = "true"
        }
      ~ tags_all      = {
          + "application"   = "Youth Justice Interactive Learning Space"
          + "business-unit" = "YJB"
          - "component"     = "None" -> null
          + "is-production" = "true"
          + "owner"         = "Youth Justice Board ICT: ict@yjb.gov.uk"
          + "source-code"   = "github.com/ministryofjustice/dns-iac"
          + "terraform"     = "true"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 5 to add, 7 to change, 5 to destroy.
╷
│ Warning: Argument is deprecated
│
│   with aws_s3_bucket.state,
│   on s3.tf line 1, in resource "aws_s3_bucket" "state":
│    1: resource "aws_s3_bucket" "state" {
│
│ Use the aws_s3_bucket_server_side_encryption_configuration resource instead
│
│ (and 5 more similar warnings elsewhere)
╵
`